
'''

Перше завдання

Створіть функцію get_days_from_today(date), яка розраховує кількість днів між заданою датою і поточною датою.

Вимоги до завдання:

1 - Функція приймає один параметр: date — рядок, що представляє дату у форматі 'РРРР-ММ-ДД' (наприклад, '2020-10-09').
2 - Функція повертає ціле число, яке вказує на кількість днів від заданої дати до поточної. Якщо задана дата пізніша за поточну, результат має бути від'ємним.
3 - У розрахунках необхідно враховувати лише дні, ігноруючи час (години, хвилини, секунди).
4 - Для роботи з датами слід використовувати модуль datetime Python.


Рекомендації для виконання:



1 - Імпортуйте модуль datetime.
2 - Перетворіть рядок дати у форматі 'РРРР-ММ-ДД' у об'єкт datetime.
3 - Отримайте поточну дату, використовуючи datetime.today().
4 - Розрахуйте різницю між поточною датою та заданою датою.
5 - Поверніть різницю у днях як ціле число.


Критерії оцінювання:



Коректність роботи функції: функція повинна точно обраховувати кількість днів між датами.
Обробка винятків: функція має впоратися з неправильним форматом вхідних даних.
Читабельність коду: код повинен бути чистим і добре документованим.

Приклад:



Якщо сьогодні 5 травня 2021 року, виклик get_days_from_today("2021-10-09") повинен повернути 157, оскільки 9 жовтня 2021 року є на 157 днів пізніше від 5 травня 2021 року.


'''
import datetime



def get_days_from_today(date) -> int:
    '''A function that calculates the number of days between a given date and the current date.'''

    
    try:
        target_date = datetime.datetime.strptime(date, '%Y-%m-%d').date()
        today = datetime.date.today()
        difference = today - target_date
        return difference.days
    except ValueError:
        return "Не корректний формат дати. Будь ласка, використовуйте формат 'РРРР-ММ-ДД'."

   
    
# Створюємо безкінечний цикл для введення даних
while True:
    user_input = input("Enter a date in 'YYYY-MM-DD' format: ")
    result = get_days_from_today(user_input)
    
    # Перевіряємо, чи результат є числом (int)
    if isinstance(result, int):
        print(f"Різниця у днях: {result}")
        break  
    else:
        print(result)
        print("-" * 100) 
